app/controllers/comments_controller.rb

  def create
    @comment = @message.comments.create(comment_params)
---
INSERT INTO "comments" ("content", "message_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "do NOT contact me with unsolicited services or offers"], ["message_id", 5], ["user_id", 2], ["created_at", 2016-10-17 17:33:53 UTC], ["updated_at", 2016-10-17 17:33:53 UTC]]

  def find_message
    @message = Message.find(params[:message_id])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def find_comment
    @comment = @message.comments.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."message_id" = ? AND "comments"."id" = ? LIMIT ?  [["message_id", 6], ["id", 4], ["LIMIT", 1]]