app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" ORDER BY created_at DESC
---
  def index
    @messages = Message.all.order("created_at DESC")

INSERT INTO "messages" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
  def create
    @message = current_user.messages.build(message_params)
    if @message.save

UPDATE "messages" SET "title" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["title", "REDWOOD STAKES!"], ["updated_at", 2016-10-17 16:37:09 UTC], ["id", 2]]
---
  def update
    if @message.update(message_params)